/***********************************************************************************************************************************************************

ESP32_C3 使用TMC2209驱动42步进电机实现电推脚控  分支：test

        该分支主要用于测试电机驱动，以及使用按钮来控制电机旋转方向。
        使用电位器读数来控制电机转速。

************************************************************************************************************************************************************/

#include <Arduino.h>
#include "my_analog_hat.h"
#include <WiFi.h>
#include <esp_now.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <AccelStepper.h>


void setup() {

}

void loop() {

}
